package theory;

public class Homework {
}
/**
 * 23.10.21;
 * 1)Реализовать стрелы на основе инвентаря, который у нас есть (можно добавить тип обьекта "type": боеприпассы, расходники, зелья)
 * Сравнение строк по значениям (equals)
 * String type;
 * 2) Количество элементов в класе item;
 *
 * 30.10.21
 * 1) Вынести весь дублирующийся код в общую функцию RangeUnit (find arrows)
 * 2) Написать тест - кейс на инвентарь (стрелы уменьшаются после атаки)
 */

/** Тест кейс
 * 1) Перейти в класс Diablo
 * Класс открыт;
 * 2) Вызвать метод ivan.checkAttackAvailable(diablo);
 * Метод возвращает true;
 * 3) Вызвать метод добавления стрел в инвентарь Ивана/Добавить 1 стрелу
 * Стрела добавлена
 * 4) Проверить добавление стрелы в инвентарь Ивана с помощью метода get.Inventory(Arrows)
 * Стрела отображается в инвентаре
 * 5) Вызвать метод атаки ivan.???(diablo)
 * Метод вызван
 * 6) Проверить здоровье diablo, после нанесения атаки
 * Здоровье уменьшилось на x едениц
 * 7) Проверить наличие стрел в инвентаре Ивана
 * Стрелы отсутствуют
 *
 *
 */